{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_regularizer": null, "return_state": false, "bias_regularizer": null, "recurrent_regularizer": null, "name": "lstm_1", "implementation": 1, "kernel_constraint": null, "unroll": false, "dtype": "float32", "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_dropout": 0.0, "go_backwards": true, "bias_constraint": null, "activity_regularizer": null, "stateful": false, "trainable": false, "activation": "tanh", "unit_forget_bias": true, "return_sequences": true, "batch_input_shape": [null, 10, 51], "units": 1000}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_regularizer": null, "return_state": false, "bias_regularizer": null, "recurrent_regularizer": null, "name": "lstm_2", "implementation": 1, "kernel_constraint": null, "unroll": false, "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_dropout": 0.0, "go_backwards": true, "trainable": false, "activity_regularizer": null, "stateful": false, "activation": "tanh", "unit_forget_bias": true, "return_sequences": true, "bias_constraint": null, "units": 1000}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_regularizer": null, "return_state": false, "bias_regularizer": null, "recurrent_regularizer": null, "name": "lstm_3", "implementation": 1, "kernel_constraint": null, "unroll": false, "recurrent_constraint": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_dropout": 0.0, "go_backwards": true, "trainable": false, "activity_regularizer": null, "stateful": false, "activation": "tanh", "unit_forget_bias": true, "return_sequences": false, "bias_constraint": null, "units": 1000}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "activation": "linear", "trainable": false, "units": 1000}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "activation": "softmax", "trainable": false, "units": 51}}], "keras_version": "2.1.5", "backend": "tensorflow"}